Repository: stefanlabuschagne/ADAConsole
Catalog: DynamicTypeDescriptor_Src/DynamicTypeDescriptorApp/Properties/Resources.*.resx
Languages: ar, da_dk

# Days_Fri_Desc
source: Venus's day.
ar: فينوس في اليوم.
da_dk: Venus 'dag.

# Days_Fri_Name
source: Friday
ar: الجمعة.
da_dk: Fredag

# Days_Mon_Desc
source: Day of the Moon.
ar: يوم من القمر.

# Days_Mon_Name
source: Monday
ar: الاثنين.
da_dk: mandag

# Days_None_Desc
source: Event will not reoccure.
ar: الحدث سوف لا reoccure.
da_dk: Begivenhed vil ikke reoccure.

# Days_None_Name
source: Not selected
ar: لم يتم تحديد.
da_dk: Ikke valgt

# Days_NoWork_Desc
source: Only Saturday and Sunday.
ar: فقط السبت والاحد.
da_dk: Kun lørdag og søndag.

# Days_NoWork_Name
source: Weekend
ar: في عطلة نهاية الاسبوع.

# Days_Sat_Desc
source: Day of Saturn.
ar: يوم من زحل.

# Days_Sat_Name
source: Saturday
ar: السبت.
da_dk: Lørdag

# Days_Sun_Desc
source: Day of the sun.
ar: يوم للشمس.
da_dk: Day of solen.

# Days_Sun_Name
source: Sunday
ar: الاحد.
da_dk: søndag

# Days_Thr_Desc
source: Day of Jupiter.
ar: يوم من كوكب المشتري.

# Days_Thr_Name
source: Thursday
ar: الخميس.
da_dk: torsdag

# Days_Tue_Desc
source: Day of Mars.
ar: يوم من المريخ.

# Days_Tue_Name
source: Tuesday
ar: الثلاثاء.
da_dk: tirsdag

# Days_Wed_Desc
source: Day of Mercury.
ar: يوم من عطارد.

# Days_Wed_Name
source: Wednesday
ar: الاربعاء.
da_dk: onsdag

# Days_Work_Desc
source: All days except Saturday and Sunday.
ar: كل يوم ما عدا السبت والاحد.
da_dk: Alle dage undtagen lørdag og søndag.

# Days_Work_Name
source: Weekdays
ar: أيام الأسبوع.
da_dk: Hverdage

# TestClass_Boolean_False_Desc
source: It is negative.
ar: ومن سلبية.
da_dk: Det er negativ.

# TestClass_Boolean_False_Name
source: Nep
ar: النيب.
da_dk: Nephi

# TestClass_Boolean_True_Desc
source: It is positive.
ar: انه امر ايجابي.
da_dk: Det er positivt.

# TestClass_Boolean_True_Name
source: Yep
ar: نعم.

# TestClass_Cat1
source: Enumeration features
ar: ملامح التعداد.
da_dk: Enumeration funktioner

# TestClass_Cat2
source: General features
ar: الخصائص العامة.
da_dk: Generelle egenskaber

# TestClass_Cat3
source: Image features
ar: ملامح صورة.
da_dk: Billede funktioner

# TestClass_Cat4
source: Standard values usage
ar: استخدام القيم القياسية.
da_dk: Standardværdier brug

# TestClass_Cat5
source: Expandable IEnumerable
ar: IEnumerable للتوسيع.
da_dk: Kan udvides IEnumerable

# TestClass_FormStartPosition_CenterParent_Desc
source: The form is centered on the current display, and has the dimensions specified in the form's size.
ar: ويتركز النموذج على العرض الحالي ، ولها أبعاد محددة في حجم النموذج.
da_dk: Formularen er centreret på den aktuelle skærm, og har dimensionerne i formularens størrelse.

# TestClass_FormStartPosition_CenterParent_Name
source: Center Parent
ar: المركز الرئيسي.
da_dk: Center Forældre

# TestClass_FormStartPosition_CenterScreen_Desc
source: The form is positioned at the Windows default location and has the dimensions specified in the form's size.
ar: يتم وضع النموذج في الموقع الافتراضي ويندوز ويحتوي على أبعاد محددة في حجم النموذج.
da_dk: Formen er placeret i Windows standard placering og har dimensionerne angivet i formularens størrelse.

# TestClass_FormStartPosition_CenterScreen_Name
source: Center Screen
ar: مركز الشاشة.
da_dk: midten af ​​skærmen

# TestClass_FormStartPosition_Manual_Desc
source: The position of the form is determined by the Location property.
ar: يتم تحديد الموقف من النموذج بواسطة الخاصية المكان.
da_dk: Placeringen af ​​den form er bestemt af sted ejendommen.

# TestClass_FormStartPosition_Manual_Name
source: Manual
ar: يدوي.
da_dk: Manuel

# TestClass_FormStartPosition_WindowsDefaultBounds_Desc
source: The form is positioned at the Windows default location and has the bounds determined by Windows default.
ar: يتم وضع النموذج في الموقع الافتراضي ويندوز ويحتوي على الحدود التي يحددها Windows الافتراضي.
da_dk: Formen er placeret i Windows standard placering og har den begrænsning, som Windows standard.

# TestClass_FormStartPosition_WindowsDefaultBounds_Name
source: Windows Default Bound
ar: رد يندوز منضم.
da_dk: Windows Standard Bundet

# TestClass_FormStartPosition_WindowsDefaultLocation_Desc
source: The form is centered within the bounds of its parent form
ar: يتركز النموذج ضمن حدود النموذج الأصل.
da_dk: Formen er centreret inden for rammerne af dets moderselskab formular

# TestClass_FormStartPosition_WindowsDefaultLocation_Name
source: Windows Default Location
ar: ويندوز الموقع الافتراضي.
da_dk: Windows Standardplacering

# TestClass_PropA_Desc
source: Demonstrates how to use enumeration without FlagsAttribute.
ar: يوضح كيفية استخدام التعداد دون FlagsAttribute.
da_dk: viser, hvordan du bruger tælling uden FlagsAttribute.

# TestClass_PropA_Name
source: Enum without Flags
ar: التعداد دون أعلام.
da_dk: Enum uden Flag

# TestClass_PropB_Desc
source: Demonstrates how to use enumeration with FlagsAttribute.
ar: يوضح كيفية استخدام التعداد مع FlagsAttribute.
da_dk: viser, hvordan du bruger tælling med FlagsAttribute.

# TestClass_PropB_Name
source: Enum with Flags
ar: التعداد مع أعلام.
da_dk: Enum med flag

# TestClass_PropC_Desc
source: Demonstrates how to use booean as enumeration.
ar: يوضح كيفية استخدام booean حيث التعداد.
da_dk: viser, hvordan du bruger booean som tælling.

# TestClass_PropC_False_Desc
source: Shows 'No' instead of 'False'.
ar: عروض "لا" بدلا من "خطأ".
da_dk: viser 'Nej' i stedet for 'falsk'.

# TestClass_PropC_False_Name
source: No
ar: رقم
da_dk: Nej

# TestClass_PropC_Name
source: Boolean without True/False
ar: دون منطقية صواب / خطأ.
da_dk: Boolean uden Sand / Falsk

# TestClass_PropC_True_Desc
source: Shows 'Yes' instead of 'True'.
ar: عروض "نعم" بدلا من كلمة "صحيح".
da_dk: viser 'Ja' i stedet for 'True'.

# TestClass_PropC_True_Name
source: Yes
ar: نعم.
da_dk: Ja

# TestClass_PropD_Desc
source: Demonstrates how to use built-in enumeration.
ar: يوضح كيفية استخدام المدمج في التعداد.
da_dk: viser, hvordan du bruger indbyggede opregning.

# TestClass_PropD_Name
source: Built-in enumeration
ar: مدمج في التعداد.
da_dk: Indbygget opregning

# TestClass_PropE_Desc
source: This property was created at run-time.
ar: تم إنشاء هذه المنشأة في وقت التشغيل.
da_dk: Denne ejendom blev oprettet på run-time.

# TestClass_PropE_Name
source: On-the-fly property
ar: على ذبابة الملكية.
da_dk: On-the-fly ejendom

# TestClass_PropF_Desc
source: Demonstrate how to disable a property.
ar: لشرح كيفية تعطيل خاصية.
da_dk: Demonstrere hvordan du kan deaktivere en ejendom.

# TestClass_PropF_Name
source: Disabled property
ar: معطل الممتلكات.
da_dk: Deaktiveret ejendom

# TestClass_PropG_Desc
source: Shows image for the property value. Test values: 0, 1, 2, and 3.
ar: يظهر صورة لقيمة العقار. قيم الاختبار : 0 ، 1 ، 2 ، و 3.
da_dk: Viser billede til ejendommens værdi. Test værdier: 0, 1, 2 og 3.

# TestClass_PropG_Name
source: Value image
ar: صورة قيمة.
da_dk: Value billede

# TestClass_PropH_Desc
source: Shows how you can show an state image for your property. Test values: 0, 1, 2, and 3.
ar: كيف يمكنك إظهار صورة الدولة للممتلكات الخاصة بك. قيم الاختبار : 0 ، 1 ، 2 ، و 3.
da_dk: Viser hvordan du kan vise et state billede til din ejendom. Test værdier: 0, 1, 2 og 3.

# TestClass_PropH_Name
source: State image(s)
ar: صورة الدولة (ق).
da_dk: State billede (r)

# TestClass_PropI_Desc
source: Demonstrate the use of standard values. This list is not exclusive, meaning you can type in the field. Test values: adam, brian, russel, jones, jakob, 101, 102, 103, 104, 105 and any integer value.
ar: شرح استخدام القيم القياسية. هذه القائمة ليست حصرية ، وهذا يعني يمكنك كتابة في هذا المجال. قيم الاختبار : آدم ، بريان ، رسل ، جونز ، جاكوب ، 101 ، 102 ، 103 ، 104 ، 105 و أي قيمة عددية.
da_dk: Demonstrere brug af standard værdier. Denne liste er ikke eksklusiv, hvilket betyder at du kan skrive i feltet. Test værdier: Adam, brian, Russel, jones, Jakob, 101, 102, 103, 104, 105 og et heltal.

# TestClass_PropI_Name
source: Standard value non-excluive
ar: قيمة قياسية غير excluive.
da_dk: Standard værdsætter ikke-excluive

# TestClass_PropJ_Desc
source: Demonstrate the use of standard values. This list is exclusive, meaning you can not type in the field.
ar: شرح استخدام القيم القياسية. هذه القائمة غير حصرية ، وهذا يعني لا يمكنك كتابة في هذا المجال.
da_dk: Demonstrere brug af standard værdier. Denne liste er eksklusiv, hvilket betyder at du kan ikke skrive i feltet.

# TestClass_PropJ_Name
source: Standard value excluive
ar: excluive قيمة قياسي.
da_dk: Standard værdi excluive

# TestClass_PropK_Desc
source: Demonstrate the use of expandable list.
ar: شرح استخدام قائمة للتوسيع.
da_dk: demonstrere brugen af ​​kan udvides listen.

# TestClass_PropK_Name
source: Expandable list
ar: توسيع قائمة.
da_dk: Kan udvides listen

# TestClass_PropL_Desc
source: Demonstrate the use of expandable array.
ar: شرح استخدام مصفوفة للتوسيع.
da_dk: demonstrere brugen af ​​udvidelsesmuligheder array.

# TestClass_PropL_Name
source: Expandable array
ar: توسيع الصفيف.
da_dk: Kan udvides vifte

# TestClass_PropM_Desc
source: Demonstrate the use of expandable collection.
ar: شرح استخدام جمع للتوسيع.
da_dk: demonstrere brugen af ​​udvides kollektionen.

# TestClass_PropM_Name
source: Expandable collection
ar: المجموعة قابلة للتوسيع.
da_dk: Kan udvides kollektion
